Revit 2027 API
ExternalResourceBrowserData.GetMatchOptions Method
 Gets the match options used to filter external resources.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ExternalResourceMatchOptions GetMatchOptions()
Public Function GetMatchOptions As ExternalResourceMatchOptions
public:
ExternalResourceMatchOptions^ GetMatchOptions()
member GetMatchOptions : unit -> ExternalResourceMatchOptions
Return Value
ExternalResourceMatchOptions
 The external resource match options.
See Also
Reference
ExternalResourceBrowserData Class
Autodesk.Revit.DB Namespace